src/test/java/DataFiles/OrgReport_CoveredRecipient.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wshealthcare:(internal)@ver=${#Project#ver}">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:OrganizationReportRequest>
            <!--You may enter the following 6 items in any order-->
            <!--Optional:-->
            <urn:User>
                <!--You may enter the following 38 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:ReferenceCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BillingCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:QueryId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:CompanyId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BillingId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LoginHistoryId/>
                <!--Optional:-->
                <!--type: int-->
                <urn:DebitUnits/>
                <!--Optional:-->
                <!--type: string-->
                <urn:IP/>
                <!--Optional:-->
                <!--type: string-->
                <urn:IndustryClass/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ResultFormat/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LogAsFunction/>
                <!--Optional:-->
                <!--type: string-->
                <urn:LogAsSuplFunction/>
                <!--Optional:-->
                <!--type: string-->
                <urn:SSNMask/>
                <!--Optional:-->
                <!--type: string-->
                <urn:DOBMask/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ExcludeDMVPII>true</urn:ExcludeDMVPII>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:DLMask/>
                <!--Optional:-->
                <!--type: string-->
                <urn:DataRestrictionMask>${DRM_NO_RESTRICT_ALL}</urn:DataRestrictionMask>
                <!--Optional:-->
                <!--type: string-->
                <urn:DataPermissionMask>${DPM_ALL}</urn:DataPermissionMask>
                <!--Optional:-->
                <!--type: string-->
                <urn:DeathMasterPurpose/>
                <!--Optional:-->
                <!--type: string-->
                <urn:SourceCode/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ApplicationType/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:SSNMaskingOn/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:DLMaskingOn/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:LnBranded>false</urn:LnBranded>
                <!--Optional:-->
                <urn:EndUser>
                    <!--You may enter the following 5 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:CompanyName/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:City/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:State/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Phone/>
                </urn:EndUser>
                <!--Optional:-->
                <!--type: int-->
                <urn:MaxWaitSeconds/>
                <!--Optional:-->
                <!--type: string-->
                <urn:RelatedTransactionId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:AccountNumber/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:OutcomeTrackingOptOut/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductType/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BatchJobId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BatchSequenceNumber/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ArchiveOptIn/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProcessSpecId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductCode/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:AllowRoamingBypass/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ConsumerStatementsMask/>
                <!--Optional:-->
                <!--type: ResultOutputType - enumeration: [,X,B,P]-->
                <urn:OutputType/>
            </urn:User>
            <!--Optional:-->
            <urn:RemoteLocations>
                <!--Zero or more repetitions:-->
                <!--type: string-->
                <urn:Item/>
            </urn:RemoteLocations>
            <!--Optional:-->
            <urn:ServiceLocations>
                <!--Zero or more repetitions:-->
                <urn:ServiceLocation>
                    <!--You may enter the following 3 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:LocationId/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:ServiceName/>
                    <!--Optional:-->
                    <urn:Parameters>
                        <!--Zero or more repetitions:-->
                        <urn:Parameter>
                            <!--You may enter the following 2 items in any order-->
                            <!--Optional:-->
                            <!--type: string-->
                            <urn:Name/>
                            <!--Optional:-->
                            <!--type: string-->
                            <urn:Value/>
                        </urn:Parameter>
                    </urn:Parameters>
                </urn:ServiceLocation>
            </urn:ServiceLocations>
            <!--Optional:-->
            <urn:HealthcareConfig>
                <!--You may enter the following 2 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:Type/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ProductKey/>
            </urn:HealthcareConfig>
            <!--Optional:-->
            <urn:Options>
                <!--You may enter the following 34 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:UserAgent/>
                <!--Optional:-->
                <!--type: integer-->
                <urn:ThresholdLimit/>
                <!--Optional:-->
                <!--type: integer-->
                <urn:ReturnCount/>
                <!--Optional:-->
                <!--type: integer-->
                <urn:StartingRecord/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeNonVendible/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAllSets/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeSanctions/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeMassCoveredRecipients>true</urn:IncludeMassCoveredRecipients>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeSpecialties/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ExcludeFacilitySanction/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:ExcludeGSASanction/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeHealthIndustryNumberingSystemIds/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeGlobalLocationNumbers/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeLicenses/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeFEIN/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeDEA/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeNPI/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeCLIA/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAHA/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludePOS/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeNCPDP/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeTaxonomy/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeMedicare/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeMedicaid/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeStateControlledSubstance>true</urn:IncludeStateControlledSubstance>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeEssentialCommunityResources/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeFacilityContacts/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeFacilityAttributes/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:IncludeAffiliations/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:SuppressLicenseHistory>true</urn:SuppressLicenseHistory>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:SortAndRankLicenseTogether/>
                <!--Optional:-->
                <!--type: boolean-->
                <urn:MixedCaseOutput/>
                <!--Optional:-->
                <!--type: unsignedInt-->
                <urn:MatchScoreThreshold/>
                <!--Optional:-->
                <!--type: string-->
                <urn:BestRules>HMS</urn:BestRules>
            </urn:Options>
            <!--Optional:-->
            <urn:ReportBy>
                <!--You may enter the following 30 items in any order-->
                <!--Optional:-->
                <!--type: string-->
                <urn:LNFID/>
                <!--Optional:-->
                <!--type: string-->
                <urn:UniqueId/>
                <!--Optional:-->
                <urn:BusinessIds>
                    <!--You may enter the following 7 items in any order-->
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:DotID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:EmpID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:POWID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:ProxID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:SeleID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:OrgID/>
                    <!--Optional:-->
                    <!--type: long-->
                    <urn:UltID/>
                </urn:BusinessIds>
                <!--Optional:-->
                <!--type: string-->
                <urn:ClientId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:OrganizationName/>
                <!--Optional:-->
                <urn:Address>
                    <!--You may enter the following 18 items in any order-->
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetNumber/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetPreDirection/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetName/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetSuffix/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetPostDirection/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:UnitDesignation/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:UnitNumber/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress1/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StreetAddress2/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:City/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:State/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Zip5/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Zip4/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:County/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:PostalCode/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:StateCityZip/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Latitude/>
                    <!--Optional:-->
                    <!--type: string-->
                    <urn:Longitude/>
                </urn:Address>
                <!--Optional:-->
                <!--type: string-->
                <urn:Phone/>
                <!--Optional:-->
                <!--type: string-->
                <urn:Fax/>
                <!--Optional:-->
                <urn:Licenses>
                    <!--Zero or more repetitions:-->
                    <urn:License>
                        <!--You may enter the following 3 items in any order-->
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Type/>
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Number/>
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:State/>
                    </urn:License>
                </urn:Licenses>
                <!--Optional:-->
                <!--type: string-->
                <urn:NPINumber>1033421664</urn:NPINumber>
                <!--Optional:-->
                <urn:DEANumbers>
                    <!--Zero or more repetitions:-->
                    <!--type: string-->
                    <urn:DEANumber/>
                </urn:DEANumbers>
                <!--Optional:-->
                <!--type: string-->
                <urn:CLIANumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:PharmacyProviderId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:FEIN/>
                <!--Optional:-->
                <urn:Taxonomies>
                    <!--Zero or more repetitions:-->
                    <!--type: string-->
                    <urn:Taxonomy/>
                </urn:Taxonomies>
                <!--Optional:-->
                <!--type: string-->
                <urn:FacilityType/>
                <!--Optional:-->
                <!--type: string-->
                <urn:OrganizationType/>
                <!--Optional:-->
                <!--type: string-->
                <urn:VerificationConfiguration/>
                <!--Optional:-->
                <!--type: string-->
                <urn:MedicareNumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:MedicareState/>
                <!--Optional:-->
                <!--type: string-->
                <urn:MedicaidNumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:MedicaidState/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ControlledSubstanceNumber/>
                <!--Optional:-->
                <!--type: string-->
                <urn:ControlledSubstanceState/>
                <!--Optional:-->
                <!--type: string-->
                <urn:Specialty/>
                <!--Optional:-->
                <!--type: string-->
                <urn:SubSpecialty/>
                <!--Optional:-->
                <!--type: string-->
                <urn:MassachusettsCoveredRecipientId/>
                <!--Optional:-->
                <urn:LegacyIds>
                    <!--Zero or more repetitions:-->
                    <urn:LegacyId>
                        <!--You may enter the following 2 items in any order-->
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Id/>
                        <!--Optional:-->
                        <!--type: string-->
                        <urn:Source/>
                    </urn:LegacyId>
                </urn:LegacyIds>
                <!--Optional:-->
                <!--type: string-->
                <urn:HealthIndustryNumberingSystemId/>
                <!--Optional:-->
                <!--type: string-->
                <urn:PointOfServiceId/>
            </urn:ReportBy>
        </urn:OrganizationReportRequest>
    </soapenv:Body>
</soapenv:Envelope>